const obj = {
    activityName:"急性心梗风险自测",
    project:
        [
            {
                name: '年龄',
                items: [
                    {
                        key: '25-35',
                        value: 0
                    },
                    {
                        key: '36-45',
                        value: 1
                    },
                    {
                        key: '46-55',
                        value: 2
                    },
                    {
                        key: '56-65',
                        value: 3
                    },
                    {
                        key: '66-75',
                        value: 4
                    },
                ]
            },
            {
                name: '体重指数',
                items: [
                    {
                        key: '18-22',
                        value: 0
                    },
                    {
                        key: '22-24',
                        value: 1
                    },
                    {
                        key: '25-30',
                        value: 2
                    },
                    {
                        key: '31-35',
                        value: 3
                    },
                    {
                        key: '>35',
                        value: 4
                    },
                ]
            },
           

        ],
    results: {
        level: [
            {
                points: '0分',
                mean: '健康',
            },
            {
                points: '1-10分',
                mean: '低危',
            },
            {
                points: '11-20分',
                mean: '中危',
            },
            {
                points: '大于20分',
                mean: '高危',
            },
        ],
        description: "中危和高危者,应当找专业医生咨询与诊治。"
    }
}

// 分值项目
// 年龄 25-35 | 36-45 | 46-55 56-65 66-75
// 体重指数(BMI) 18-22 | 22-24 | 25-30 31-35> 35
// 家族史 无有
// 高血压 无有/不知道
// 糖尿病 无有
// 运动 每天(30min)|偶尔|极少从不
// 总胆固醇水平mg/dL < 200 201-239>240/不知道
// 高密度脂蛋白水平mg/dL 50-59 45-49/ <45/> 60 |不知道
// 低密度脂蛋白水平mg/dL <130< 100/> 160/不知道

// 甘油三酯水平mg/dL 150-199/200-250/不知道<250
// 吸烟 不吸/ 已戒5年1已戒1年已戒10年未戒
// 绝经或有心脏病、卒中史 否 是,在使1是,未使用激素替|用激素替代治疗|代治疗
// 处理愤怒的方式 避免冲突摔门而去生闷气